Merge pull request #50 from AndrewRedican/minor-fixes
Version / Build Executor Improvements and Mermaid docs
